##
## Install all packages with homebrew bundle:
## - https://github.com/Homebrew/homebrew-bundle
##
## curl -sSfL https://github.com/ibraheemdev/modern-unix/raw/HEAD/Brewfile | brew bundle install --file=-
##

# A cat(1) clone with syntax highlighting and Git integration
brew "bat"
# exa is a modern replacement for the venerable file-listing command-line program ls
brew "exa"
# A syntax-highlighting pager for git, diff, and grep output
brew "git-delta"
# du + rust = dust. Like du but more intuitive
brew "dust"
# duf wants to be better df alternative
brew "duf"
# broot is a better way to navigate directories.It is fast and doesn’t block
brew "broot"
# fd is a program to find entries in your filesystem
brew "fd"
# An extremely fast alternative to grep that respects your gitignore
brew "ripgrep"
# McFly replaces your default ctrl-r shell history search
brew "mcfly"
# This is choose, a human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# dog is a command-line DNS client, like dig
brew "dog"
# cheat allows you to create and view interactive cheatsheets on the command-line
brew "cheat"
# System monitoring dashboard for terminal
brew "gtop"
# Ping, but with a graph
brew "gping"
# procs is a replacement for ps written in Rust
brew "procs"
# HTTPie (pronounced aitch-tee-tee-pie) is a command-line HTTP client.
brew "httpie"
# If you like the interface of HTTPie but miss the features of curl
brew "curlie"
