# get tools listed on https://github.com/ibraheemdev/modern-unix

tap "cantino/mcfly"
tap "clementtsang/bottom"

brew "bat"
brew "exa"
brew "lsd"
brew "git-delta"
brew "dust"
brew "duf"
brew "broot"
brew "fd"
brew "mcfly"
brew "ripgrep"
brew "the_silver_searcher"
brew "fzf"
brew "choose-rust"
brew "jq"
brew "sd"
brew "bottom"
brew "glances"
brew "hyperfine"
brew "gping"
brew "procs"
brew "httpie"
brew "curlie"
brew "xh"
brew "zoxide"
brew "dog"